package com.Shakwa.user.Enum;

import com.fasterxml.jackson.annotation.JsonValue;

public enum GovernmentAgencyType {

    وزارة_الإدارة_المحلية_والبيئة,
    وزارة_المالية,
    وزارة_الدفاع,
    وزارة_الاقتصاد_والصناعة,
    وزارة_التعليم_العالي,
    وزارة_الصحة,
    وزارة_التربية,
    وزارة_الطاقة,
    أمانة_رئاسة_مجلس_الوزراء,
    وزارة_الأشغال_العامة_والإسكان,
    وزارة_الاتصالات_والتقانة,
    وزارة_الداخلية,
    وزارة_الزراعة,
    وزارة_الشؤون_الاجتماعية_والعمل,
    وزارة_الثقافة,
    وزارة_النقل,
    وزارة_العدل,
    وزارة_السياحة,
    وزارة_الإعلام,
    وزارة_الأوقاف,
    نقابة_المعلمين,
    الاتحاد_الرياضي_العام,
    الاتحاد_العام_للفلاحين,
    مجلس_الدولة,
    وزارة_التنمية_الإدارية,
    وزارة_الخارجية_والمغتربين,
    وزارة_الطوارئ_والكوارث,
    الهيئة_العامة_للمنافذ_البرية_والبحرية,
    مصرف_سوريا_المركزي;

    @JsonValue
    public String getLabel() {
        return this.name().replace("_", " ");
    }
}
